const tasks = [
  "игры пошаговые",
  "игры динамические",
  "конвертеры",
  "редакторы",
  "презентации",
  "чистые функции",
  "реимплементации",
  "классы",
  "шаблонизаторы",
  "менеджеры записей",
  "серверы",
  "API",
  "API-клиенты",
  "визуализации",
  "фреймворки",
  "компоненты",
  "библиотеки",
  "модули",
  "использование сторонних",
  "сервисы данных",
  "лендинги",
  "магазины",
  "вёрстка макетов",
  "концепт-примеры",
  "генераторы данных",
  "клоны сервисов",
  "эмуляции",
  "боты",
  "файловые менеджеры",
  "планировщики",
  "органайзеры",
  "статистика и анализ данных",
  "галереи",
  "общение",
  "документация",
  "тесты",
  "сборки",
  "сборщики",
  "расширения",
  "аудио",
  "видео",
  "постановка задач",
  "рефакторинг",
  "поиск, исправление ошибок",
  "чтение и пояснение кода",
  "шаблоны",
  "ресёрч направления",
  "статьи",
  "доклады",
  "интеграция",
  "автоматизация",
  "макеты",
  "оформление",
  "архитектурное проектирование"
].slice(-20)

const changeInterval = 300

const switchPlaces = showList(tasks, changeInterval)

const sortChangeEventEmitter = asyncGradualSort(tasks, changeInterval)

sortChangeEventEmitter.addEventListener('change', ({switchedIndices}) => {
  switchPlaces(...switchedIndices)
})
